Котельников_АБ_70153995/src/Documents/СогласованиеЗаявки/СогласованиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласованиеЗаявки</name>
  <basedOn>Document.ЗаявкаНаПодбор</basedOn>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отклонена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеПричины</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/Enums/СтатусыЗаявокНаПодбор/СтатусыЗаявокНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаПодбор</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Согласование</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/СогласованиеЗаявки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаПодбор") Тогда
		// Заполнение шапки
		АвторДокумента = ДанныеЗаполнения.АвторДокумента;
		ИнициаторЗаявки = ДанныеЗаполнения.ИнициаторЗаявки;
		Заявка = ДанныеЗаполнения.Ссылка;		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Ссылка.Пустая() Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.Согласование);	
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	
	Если Согласована Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.ВРаботе);
	ИначеЕсли Отклонена Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.Отклонена);
	ИначеЕсли НЕ Согласована И НЕ Отклонена Тогда
		ИзменитьСтатусЗаявки(Перечисления.СтатусыЗаявокНаПодбор.Согласование);
	КонецЕсли;
	
КонецПроцедуры


Процедура ИзменитьСтатусЗаявки(Статус)
	
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	ЗаявкаОбъект.СтатусЗаявки = Статус;
	ЗаявкаОбъект.Записать();
	
КонецПроцедуры
